Docs: Refine descriptions, fix diagrams, lowercase filenames
